src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказовПоставщикам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/СтатусыЗаказовПоставщикам/СтатусыЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗаказовПоставщикам</name>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
  </predefined>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ЗаказПоставщику/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выборка = Справочники.СтатусыЗаказовПоставщикам.Выбрать(,,,"Порядок");
	Пока Выборка.Следующий() Цикл
		
		//1. создание команды
		Идентификатор = Новый УникальныйИдентификатор;
		ИмяКоманды = "Команда_" + СтрЗаменить(Идентификатор, "-", "");
		
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "ИзменитьСтатусЗаказов";
		НоваяКоманда.Заголовок = Выборка.Наименование;
		
		//2. создание элемента формы (кнопка)
		НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ПодменюСтатусы);
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
		//3. добавление строки в таблицу статусов
		СтрокаСтатуса = СписокСтатусов.Добавить();
		СтрокаСтатуса.ИмяКоманды = ИмяКоманды;
		СтрокаСтатуса.Статус = Выборка.Ссылка;
		СтрокаСтатуса.Представление = Выборка.Наименование;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусЗаказов(Команда)

	//1. определение статуса по имени команды
	ИмяКоманды = Команда.Имя;
	
	СтруктураОтбора = Новый Структура("ИмяКоманды", ИмяКоманды);
	НайденныеСтроки = СписокСтатусов.НайтиСтроки(СтруктураОтбора);
	
	НовыйСтатус = НайденныеСтроки[0].Статус;
	
	//2. определить выделенные заказы
	МассивЗаказов = Элементы.Список.ВыделенныеСтроки;
	
	//3. Изменение статусов
	ИзменитьСтатусЗаказовНаСервере(МассивЗаказов, НовыйСтатус);
	
	//4. Обновление динамических спискова
	ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	ПоказатьОповещениеПользователя("Изменение статусов завершено...");
	
КонецПроцедуры // ИзменитьСтатусЗаказов()

&НаСервереБезКонтекста
Процедура ИзменитьСтатусЗаказовНаСервере(МассивЗаказов, НовыйСтатус)

	Для каждого ЗаказПоставщика Из МассивЗаказов Цикл
		
		ДокОбъект = ЗаказПоставщика.ПолучитьОбъект();
		Если ДокОбъект.Статус = НовыйСтатус Тогда
			Продолжить;
		КонецЕсли; 
		
		ДокОбъект.Статус = НовыйСтатус;
		
		РежимЗаписи = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		ДокОбъект.Записать(РежимЗаписи);
		
	КонецЦикла; 

КонецПроцедуры // ИзменитьСтатусЗаказовНаСервере()
